#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>


//int main()
//{
//	int a = 5 / 2; //商2余1
//	double b = 5 / 2.0;
//	printf("%d\n", a);
//	printf("%lf\n", b);
//	return 0;
//}


//int main()
//{
//	int a = 16;
//	//  >> --- 右移操作符
//	// 移动的是二进制位
//	// 0000 0000 0000 0000 0000 0000 0001 0000
//	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}


//int main()
//{
//	int a = -1;
//	
//	// 整数的二进制表示有三种：原码、反码、补码
//	// 整数存储到内存中的是补码
//	// 1111 1111 1111 1111 1111 1111 1111 1111
//	// -1右移任意位后结果仍为-1 
//	int b = a >> 2;
//	printf("%d\n", b);
//	return 0;
//}


//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	// 0000 0000 0000 0000 0000 0000 0000 0101
//	printf("%d\n", b); 
//	return 0;
//}

//int main()
//{
//	// & -- 按二进制位与
//	/*int a = 3;
//	int b = 5;
//	int c = a & b;*/
//	// 0000 0000 0000 0000 0000 0000 0000  0011
//	// 0000 0000 0000 0000 0000 0000 0000  0101
//	// 0000 0000 0000 0000 0000 0000 0000  0001
//	//printf("%d\n", c); // 1
//
//	// | -- 按二进制位或
//	/*int a = 3;
//	int b = 5;
//	int d = a | b;*/
//	// 0000 0000 0000 0000 0000 0000 0000  0011
//	// 0000 0000 0000 0000 0000 0000 0000  0101
//	// 0000 0000 0000 0000 0000 0000 0000  0111
//	//printf("%d\n", d); //7
//
//	// ^ --按二进制位异或
//	// 相同为0，相异为1
//	int a = 3;
//	int b = 5;
//	int e = a ^ b;
//	// 0000 0000 0000 0000 0000 0000 0000  0011
//	// 0000 0000 0000 0000 0000 0000 0000  0101
//	// 0000 0000 0000 0000 0000 0000 0000  0110
//	printf("%d\n", e); // 6
//	return 0;
//} 


// 要求不使用临时变量，交换两个数的值

//int main()
//{
//	int a = 3;
//	int b = 5;
//	// 加减法 (缺点：如果a和b的值比较大，会溢出某些二进制位)
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	//printf("%d %d", a, b); // 5 3
//
//	// 异或的方法(缺点：可读性较差）
//	a = a ^ b; //6
//	// 0000 0000 0000 0000 0000 0000 0000  0011
//    // 0000 0000 0000 0000 0000 0000 0000  0101
//	// 0000 0000 0000 0000 0000 0000 0000  0110
//	b = a ^ b; // 3
//	// 0000 0000 0000 0000 0000 0000 0000  0110
//	// 0000 0000 0000 0000 0000 0000 0000  0101
//    // 0000 0000 0000 0000 0000 0000 0000  0011
//	a = a ^ b; // 5
//	// 0000 0000 0000 0000 0000 0000 0000  0110
//	// 0000 0000 0000 0000 0000 0000 0000  0011
//	// 0000 0000 0000 0000 0000 0000 0000  0101
//	printf("%d %d", a, b);
//	return 0;
//}


// 编写代码，求一个整数存储在内存中的二进制中1的个数
//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);
//	// 32bit
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (1 == ((num >> i) & 1))
//			count++;
//	}
//
//	//统计num的补码中有几个1 
//	//while (num != 0) // 缺点:只能求正数
//	//{
//	//	if (num % 2 == 1)
//	//		count++;
//	//	num = num / 2;
//	//}
//	printf("%d\n", count);
//	return 0;
//}

//方法3---Brian Kernighan 算法,时间复杂度 O(k)
//O(k) 中的 k 是问题的某个特定参数（例如二进制中 1 的个数、图的边数等）
//O(n) 中的 n 通常指输入规模（例如数组长度、数值大小等）
//int main()
//{
//	int num = -1;
//	int count = 0; //计数
//	while (num)
//	{
//		count++;
//		num = num & (num - 1);
//	}
//	printf("二进制中1的个数 = %d\n", count);
//	return 0;
//	
//}

//int main()
//{
//	int a = 10;
//	if (a)
//	{
//		printf("呵呵\n");
//	}
//	if (!a)
//	{
//		printf("呵呵\n");
//	}
//	/*printf("%d\n", !a);*/
//	//a = a + 2;
//	//a += 2;//复合赋值符
//
//	//a = a >> 1;
//	//a >>= 1;
//
//	//a = a & 1;
//	//a &= 1; 
//	return 0;
//}

//int main()
//{
//	int a = -5;
//	a = -a;
//	return 0;
//
//}

//int main()
//{
//	int a = 10;
//	int* p=&a; //取地址操作符
//	*p = 20; //解引用操作符
//	return 0;
//}

int main()
{
	int a = 10;
	char c = 'r';
	char* p = &c;
	int arr[10] = { 0 };

	// 计算变量所占内存空间的大小，单位是字节
	printf("%d\n",sizeof(a)); // 4
	printf("%d\n", sizeof(int));

	printf("%d\n", sizeof(c)); // 1
	printf("%d\n", sizeof(char));

	printf("%d\n", sizeof(p)); // 8(x64为8，X32为4）
	printf("%d\n", sizeof(char*));

	printf("%d\n", sizeof(arr));// 40
	printf("%d\n", sizeof(int [10]));//40
	return 0;

}